Revit 2027 API
Frame(XYZ, XYZ, XYZ, XYZ) Constructor
 Constructor that takes the frame's base point and three basis vectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Frame(
	XYZ origin,
	XYZ vec1,
	XYZ vec2,
	XYZ vec3
)
Public Sub New (
	origin As XYZ,
	vec1 As XYZ,
	vec2 As XYZ,
	vec3 As XYZ
)
public:
Frame(
	XYZ^ origin,
	XYZ^ vec1,
	XYZ^ vec2,
	XYZ^ vec3
)
new :
        origin : XYZ *
        vec1 : XYZ *
        vec2 : XYZ *
        vec3 : XYZ -> Frame
Parameters
origin XYZ
 The frame's base point.
vec1 XYZ
 The frame's first basis vector.
vec2 XYZ
 The frame's second basis vector.
vec3 XYZ
 The frame's third basis vector.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Frame Class
Frame Overload
Autodesk.Revit.DB Namespace